export const textSupport = [
  "Использование программы допустимо для расчета моноблочной УБР в первом приближении.",
  "Типовые ошибки:",
  "некорректные исходные данные,в том числе отрицательный параметр.",
  "Литература:",
  "1.	Ю.М. Николаев, Ю. С. Соломонов Основы проектирования твердотопливных управляемых баллистических ракет.",
  "2. В.Т. Лизин, В.А. Пяткин Проектирование тонкостенных конструкций. ",
  "Автор: М.И.Кустова (дипломный проект, 2023г)",
  "Поддержка: mashkusti@gmail.com",
];
